# config.py
# Токен бота и ID канала
TOKEN = "7555802784:AAHMOsVjJJlYivpBSdudIgGb1mlqDKdWsSU"  # Замените на токен вашего бота
CHANNEL_ID = "@fireshotnews"  # Замените на имя вашего канала

# Ограничение длины аннотации
SUMMARY_LIMIT = 500

# Время задержки между отправками и проверками (в секундах)
POST_INTERVAL = 10  # секунд
CHECK_INTERVAL = 2100  # 35 минут

# Часы, когда бот "молчит" (час начала и час конца по МСК)
QUIET_HOURS = (0, 7)  # с 00:00 до 07:00 по МСК

# RSS-каналы и ключевые слова для фильтрации новостей
RSS_FEEDS = [
    "https://www.kommersant.ru/RSS/news.xml",
    "https://tass.ru/rss/v2.xml",
    "https://ria.ru/export/rss2/archive/index.xml",
    "https://lenta.ru/rss",
    "https://www.gazeta.ru/export/rss/lenta.xml",
    "https://rssexport.rbc.ru/rbcnews/news/30/full.rss",
    "https://rg.ru/xml/index.xml",
    "https://www.interfax.ru/rss.asp",
]
KEYWORDS = [
    "война", "СВО", "конфликт", "боевые действия", "обстрел", "атака",
    "Украина", "Россия", "Донбасс", "ВСУ", "территории", "территориальная целостность",
    "терроризм", "теракт", "взрыв", "захват", "нападение", "антитеррор",
    "силовые структуры", "МВД", "ФСБ", "Минобороны", "национальная безопасность",
    "чрезвычайное происшествие", "ЧП", "происшествие", "крушение", "катастрофа",
    "авария", "пожар", "взрыв", "трагедия", "жертвы", "гибель",
    "погибшие", "раненые", "эвакуация", "спасение", "спасатели", "спасательные службы",
    "срочные новости", "экстренное сообщение", "неотложные новости", "заявление",
    "обострение", "санкции", "политическое заявление", "конфликтная зона",
    "безопасность", "военное положение", "боеготовность", "мобилизация",
    "израиль", "сектор газа", "ХАМАС", "палестина", "мирные жители",
    "сша", "нато", "запад", "оружие", "вооружение", "боеприпасы",
    "военная техника", "военные действия", "бои", "мирные переговоры", "дезинформация",
    "срочное заявление", "оперативные меры", "захват заложников", "освобождение заложников",
    "разведка", "пограничная безопасность", "военная операция", "боевые потери",
    "контртеррористическая операция", "урегулирование конфликта", "силовые структуры"
]
